In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [6]:
dates = pd.date_range('20200328', periods=6)

In [7]:
dates

DatetimeIndex(['2020-03-28', '2020-03-29', '2020-03-30', '2020-03-31',
               '2020-04-01', '2020-04-02'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2020-03-28 -1.297889 -0.045009 -0.491107  0.353253
2020-03-29  0.924232 -0.320929  1.415668  0.751182
2020-03-30 -0.944927  0.554666  0.844305  0.599970
2020-03-31 -0.777890 -0.505387  1.023630  1.672898
2020-04-01  0.359295 -0.948233 -0.519294  0.710305
2020-04-02 -0.323679 -0.453417 -0.418897  1.417317

In [29]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20200328', periods=6))

In [30]:
s1

2020-03-28    1
2020-03-29    2
2020-03-30    3
2020-03-31    4
2020-04-01    5
2020-04-02    6
Freq: D, dtype: int64

In [31]:
df['F'] = s1

In [32]:
df.at[dates[0], 'A'] = 0

In [33]:
df.iat[0, 1] = 0

In [34]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [35]:
df

                   A         B         C  D  F
2020-03-28  0.000000  0.000000 -0.491107  5  1
2020-03-29  0.924232 -0.320929  1.415668  5  2
2020-03-30 -0.944927  0.554666  0.844305  5  3
2020-03-31 -0.777890 -0.505387  1.023630  5  4
2020-04-01  0.359295 -0.948233 -0.519294  5  5
2020-04-02 -0.323679 -0.453417 -0.418897  5  6

In [36]:
df2 = df.copy()

In [37]:
df2[df2 > 0] = -df2

In [38]:
df2

                   A         B         C  D  F
2020-03-28  0.000000  0.000000 -0.491107 -5 -1
2020-03-29 -0.924232 -0.320929 -1.415668 -5 -2
2020-03-30 -0.944927 -0.554666 -0.844305 -5 -3
2020-03-31 -0.777890 -0.505387 -1.023630 -5 -4
2020-04-01 -0.359295 -0.948233 -0.519294 -5 -5
2020-04-02 -0.323679 -0.453417 -0.418897 -5 -6

## 누락된 데이터

In [39]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [40]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [41]:
df1

                   A         B         C  D  F    E
2020-03-28  0.000000  0.000000 -0.491107  5  1  1.0
2020-03-29  0.924232 -0.320929  1.415668  5  2  1.0
2020-03-30 -0.944927  0.554666  0.844305  5  3  NaN
2020-03-31 -0.777890 -0.505387  1.023630  5  4  NaN

In [42]:
df1.dropna(how='any')

                   A         B         C  D  F    E
2020-03-28  0.000000  0.000000 -0.491107  5  1  1.0
2020-03-29  0.924232 -0.320929  1.415668  5  2  1.0

In [43]:
df1.fillna(value=5)

                   A         B         C  D  F    E
2020-03-28  0.000000  0.000000 -0.491107  5  1  1.0
2020-03-29  0.924232 -0.320929  1.415668  5  2  1.0
2020-03-30 -0.944927  0.554666  0.844305  5  3  5.0
2020-03-31 -0.777890 -0.505387  1.023630  5  4  5.0

In [45]:
pd.isna(df1)

                A      B      C      D      F      E
2020-03-28  False  False  False  False  False  False
2020-03-29  False  False  False  False  False  False
2020-03-30  False  False  False  False  False   True
2020-03-31  False  False  False  False  False   True

## 통계

In [46]:
df.mean()

A   -0.127162
B   -0.278883
C    0.309051
D    5.000000
F    3.500000
dtype: float64

In [47]:
df.mean(1)

2020-03-28    1.101779
2020-03-29    1.803794
2020-03-30    1.690809
2020-03-31    1.748071
2020-04-01    1.778354
2020-04-02    1.960801
Freq: D, dtype: float64

In [51]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates.shift(2))

In [52]:
s

2020-03-30    1.0
2020-03-31    3.0
2020-04-01    5.0
2020-04-02    NaN
2020-04-03    6.0
2020-04-04    8.0
Freq: D, dtype: float64

In [53]:
df.sub(s, axis='index')

                   A         B         C    D    F
2020-03-28       NaN       NaN       NaN  NaN  NaN
2020-03-29       NaN       NaN       NaN  NaN  NaN
2020-03-30 -1.944927 -0.445334 -0.155695  4.0  2.0
2020-03-31 -3.777890 -3.505387 -1.976370  2.0  1.0
2020-04-01 -4.640705 -5.948233 -5.519294  0.0  0.0
2020-04-02       NaN       NaN       NaN  NaN  NaN
2020-04-03       NaN       NaN       NaN  NaN  NaN
2020-04-04       NaN       NaN       NaN  NaN  NaN

## 적용

In [54]:
df.apply(np.cumsum)

                   A         B         C   D   F
2020-03-28  0.000000  0.000000 -0.491107   5   1
2020-03-29  0.924232 -0.320929  0.924561  10   3
2020-03-30 -0.020695  0.233737  1.768866  15   6
2020-03-31 -0.798585 -0.271650  2.792496  20  10
2020-04-01 -0.439290 -1.219883  2.273202  25  15
2020-04-02 -0.762969 -1.673300  1.854305  30  21

In [55]:
df.apply(lambda x: x.max() - x.min())

A    1.869159
B    1.502899
C    1.934962
D    0.000000
F    5.000000
dtype: float64

In [56]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [57]:
s

0    1
1    5
2    3
3    4
4    0
5    6
6    5
7    1
8    3
9    6
dtype: int32

In [58]:
s.value_counts()

6    2
5    2
3    2
1    2
4    1
0    1
dtype: int64

In [59]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [60]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## 병합 
##### *다시봐야함

In [61]:
df = pd.DataFrame(np.random.randn(10, 4))

In [62]:
df

          0         1         2         3
0 -1.795845 -0.736682 -2.395694 -1.083076
1 -0.129909  0.133587  1.773671  0.830404
2  1.044588 -0.577551  0.568378  1.487458
3  0.074452  1.700168  1.260168  0.093936
4  0.478202  1.160755  1.624837 -0.250365
5  0.124020 -0.255375  0.891261  1.441278
6 -0.084547 -0.632495  0.350198 -0.247792
7 -0.857945 -0.243506 -1.483860 -0.652419
8  0.520739 -0.921389  0.006081  0.528856
9 -0.445460  2.269027  2.320447  0.093347

In [63]:
pieces = [df[:3], df[3:7], df[7:]]

In [64]:
pd.concat(pieces)

          0         1         2         3
0 -1.795845 -0.736682 -2.395694 -1.083076
1 -0.129909  0.133587  1.773671  0.830404
2  1.044588 -0.577551  0.568378  1.487458
3  0.074452  1.700168  1.260168  0.093936
4  0.478202  1.160755  1.624837 -0.250365
5  0.124020 -0.255375  0.891261  1.441278
6 -0.084547 -0.632495  0.350198 -0.247792
7 -0.857945 -0.243506 -1.483860 -0.652419
8  0.520739 -0.921389  0.006081  0.528856
9 -0.445460  2.269027  2.320447  0.093347

## Join

In [67]:
left = pd.DataFrame({'key' : ['foo', 'foo'], 'lval':[1,2]})

In [69]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [70]:
left

   key  lval
0  foo     1
1  foo     2

In [71]:
right

   key  rval
0  foo     4
1  foo     5

In [72]:
pd.merge(left,right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [73]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [75]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [76]:
left

   key  lval
0  foo     1
1  bar     2

In [77]:
right

   key  lval
0  foo     4
1  bar     5

In [78]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

## 그룹화

In [79]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                       'B': ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [80]:
df

     A      B         C         D
0  foo    one  0.166418 -0.180161
1  bar    one  0.071794 -0.383570
2  foo    two -0.062072 -1.303839
3  bar  three  0.461801 -0.287702
4  foo    two -0.918275 -0.281493
5  bar    two  0.755471 -0.032402
6  foo    one -0.827444  0.780698
7  foo  three -0.742782  1.889520

In [81]:
df.groupby('A').sum()

            C         D
A
bar  1.289066 -0.703674
foo -2.384155  0.904725

In [82]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.071794 -0.383570
    three  0.461801 -0.287702
    two    0.755471 -0.032402
foo one   -0.661026  0.600538
    three -0.742782  1.889520
    two   -0.980347 -1.585333

## 형태변경
### 스택

In [83]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [88]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [84]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [85]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [86]:
df2 = df[:4]

In [87]:
df2

                     A         B
first second
bar   one    -1.210236  0.838010
      two    -0.903029 -0.788542
baz   one    -0.304413 -0.820141
      two    -0.364016  0.400624

In [89]:
stacked = df2.stack()

In [90]:
stacked

first  second
bar    one     A   -1.210236
               B    0.838010
       two     A   -0.903029
               B   -0.788542
baz    one     A   -0.304413
               B   -0.820141
       two     A   -0.364016
               B    0.400624
dtype: float64

In [91]:
stacked.unstack()

                     A         B
first second
bar   one    -1.210236  0.838010
      two    -0.903029 -0.788542
baz   one    -0.304413 -0.820141
      two    -0.364016  0.400624

In [92]:
stacked.unstack(1)

second        one       two
first
bar   A -1.210236 -0.903029
      B  0.838010 -0.788542
baz   A -0.304413 -0.364016
      B -0.820141  0.400624

In [93]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.210236 -0.304413
       B  0.838010 -0.820141
two    A -0.903029 -0.364016
       B -0.788542  0.400624

In [94]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                       'E': np.random.randn(12)})

In [95]:
df

        A  B    C         D         E
0     one  A  foo  0.321848  0.404851
1     one  B  foo -1.007602  1.071138
2     two  C  foo -0.361793  2.004132
3   three  A  bar  0.035771 -0.659334
4     one  B  bar  0.005186 -1.088091
5     one  C  bar  0.311644  0.639641
6     two  A  foo -0.087764  1.690379
7   three  B  foo -0.420372  1.863657
8     one  C  foo  2.537479  1.233661
9     one  A  bar  1.571473 -0.613934
10    two  B  bar -0.454427  0.166033
11  three  C  bar -0.457910 -0.277226

In [96]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.571473  0.321848
      B  0.005186 -1.007602
      C  0.311644  2.537479
three A  0.035771       NaN
      B       NaN -0.420372
      C -0.457910       NaN
two   A       NaN -0.087764
      B -0.454427       NaN
      C       NaN -0.361793